{
  "lastUpdated": "2026-01-11T12:00:00.000Z",
  "notes": [
    {
      "partner": "Xray Tech",
      "owner": "Brandon",
      "meetingDate": "2026-01-09",
      "content": "<strong>Jan 9, 2026 Meeting Summary</strong><br><br><strong>Upmarket Opportunity Discussed:</strong><br>Green Check Verified - Tom secured verbal thumbs up from co-founder/CSO for MCP sales meeting. Current Pro 50k customer; AI/MCP is huge priority for their dev team enablement. Found 8 accounts associated (only 1 paid) - consolidation opportunity.<br><br><strong>Action Items:</strong><br>Brandon: Get MCP enablement materials from Chris Ondera (Due: Jan 13)<br>Brandon: Prep MCP pitch deck using Gamma (Due: Jan 15)<br>Tom/Aris: Complete Zapier training to maintain Platinum status (Due: Jan 17)<br>Team: Schedule Green Check sales meeting (Due: Jan 20)"
    },
    {
      "partner": "Pyxis",
      "owner": "Brandon",
      "meetingDate": "2026-01-09",
      "content": "<strong>Jan 9, 2026 Meeting Summary</strong><br><br><strong>Upmarket Opportunity Strategy:</strong><br>Focus on proving co-sell motion with ONE account before scaling. Target: Austin-based accounts to enable in-person Workflow Lab event. MDF budget available: $1,000-$2,500 range.<br><br><strong>Co-Marketing Plans:</strong><br>Austin Workflow Lab event targeting Rev Ops professionals. AI Train the Trainer bootcamp pilot with Pyxis team.<br><br><strong>Action Items:</strong><br>Parker Short: Review client list for Austin-based accounts (Due: Jan 16)<br>Parker Short: Submit MDF form for Austin Workflow Lab event (Due: Jan 16)<br>Brandon: Absorb AI Train the Trainer material (Due: Jan 17)"
    },
    {
      "partner": "iZeno",
      "owner": "Michael Shen",
      "meetingDate": null,
      "content": "<strong>Status: Pending Activation</strong><br><br>No active upmarket opportunity yet. Reviewing potential accounts with Michael Shen. Singapore time zone presents scheduling challenges.<br><br><strong>Action Items:</strong><br>Michael Shen: Review submitted account list and prioritize (Due: Jan 17)<br>Brandon: Schedule sync with Michael to align on activation (Due: Jan 20)"
    },
    {
      "partner": "Orium (Myplanet)",
      "owner": "Michael Shen",
      "meetingDate": "2026-01-09",
      "content": "<strong>Jan 9, 2026 Partnership Kickoff Meeting</strong><br><br>Partnership exploration with Orium (250-person professional services firm). Focus areas: AI orchestration, agent solutions, headless commerce. Enterprise clients include: Apple, Steelcase, Stripe.<br><br><strong>Key Discussion Points:</strong><br>Showcased Stripe automated payment audit solution. Offer Agentix Strategy Canvas - 2-day workshop for client AI readiness. Bruce Lee (new AE, 10yr iPaaS experience) will be primary contact.<br><br><strong>Action Items:</strong><br>Ryan Kaschak: Bring specific customer examples to follow-up meeting<br>Bruce Lee (Orium): Review Crossbeam shared customers (Due: Jan 20)<br>Michael Shen: Schedule follow-up strategy meeting (Due: Jan 17)"
    },
    {
      "partner": "Connex Digital",
      "owner": "Brandon",
      "meetingDate": null,
      "content": "<strong>Status: Partner Services Fund Opportunity</strong><br><br>PSF engagement with Connex Digital for enterprise implementation support. Active referral partner with $9,237 revenue and 460 referrals in 2025.<br><br><strong>Action Items:</strong><br>Brandon: Define PSF engagement scope and budget (Due: Jan 20)<br>Brandon: Align with Andres on partner deliverables (Due: Jan 17)<br>Team: Identify target enterprise customer for PSF pilot (Due: Jan 24)"
    }
  ]
}